[
	{
		"switch": "1piboot",
		"description":
			"Specify a 1piboot.conf file to use instead of the one in <code>/usr/local/sdm/1piboot/1piboot.conf</code>.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "file",
		"argumentValue": "",
		"message": "Select a 1piboot.conf file.",
		"errorMessage": "A valid 1piboot.conf file is required."
	},

	{
		"switch": "aptcache",
		"description":
			"Use APT caching. The argument is the IP address of the apt-cacher-ng server.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "ipAddress",
		"argumentValue": "",
		"message": "Enter the IP address of the apt-cacher-ng server.",
		"errorMessage": "A valid IP address is required."
	},

	{
		"switch": "apt-dist-upgrade",
		"description":
			"Some RasPiOS Bullseye images have a strange software configuration, which causes apt-get upgrade to fail. This switch forces sdm to use apt-get --dist-upgrade which updates correctly. <br>In the 2021-10-30 set of images, the 'with Desktop' versions have a set of problematic VLC modules installed.",
		"selected": true,
		"editable": true,
		"hasArgument": false
	},

	{
		"switch": "autologin",
		"description":
			"Cause the user to autologin when the system (re)starts.",
		"selected": true,
		"editable": true,
		"hasArgument": false
	},

	{
		"switch": "b0script",
		"description":
			"Call the function do_b0script in script when burning. script will be called after the output has been burned, and operates in effectively a Phase 0 environment.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "file",
		"argumentValue": "",
		"message": "Select a b0script file.",
		"errorMessage": "A valid b0script file is required."
	},

	{
		"switch": "b1script",
		"description":
			"Like --b0script, but is called in an nspawn container.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "file",
		"argumentValue": "",
		"message": "Select a b1script file.",
		"errorMessage": "A valid b1script file is required."
	},

	{
		"switch": "batch",
		"description":
			"Do not provide an interactive command prompt inside the nspawn container.",
		"selected": true,
		"editable": false,
		"hasArgument": false
	},

	{
		"switch": "bootscripts",
		"description":
			"Directs sdm-firstboot to run the boot scripts in /usr/local/sdm/1piboot/0*-*.sh. If --bootscripts is specified when creating the sdm-enhanced IMG, every SD Card burned will run the boot scripts on First Boot. If not specified on IMG creation, it can be also be specified when burning the SD Card to run the boot scripts on that SD Card.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "directory",
		"argumentValue": "",
		"message": "Select a boot script directory.",
		"errorMessage": "A valid boot script directory is required."
	},

	{
		"switch": "bupdate",
		"description":
			"Used only on --burn command. Item can be plugin: Check and update plugins",
		"selected": false,
		"editable": false,
		"hasArgument": true,
		"argumentType": "file",
		"argumentValue": "",
		"message": "Select a plugin file, or leave empty for all plugins.",
		"errorMessage": "A valid plugin file is required, or leave blank for all."
	},

	{
		"switch": "chroot",
		"description": 
			"By default sdm uses systemd-nspawn to enter the container in Phase 1/post-install phases. Some (likely older) host OSes may have issues with that. If systemd-nspawn fails with an execve error, retry the command and add --chroot.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},

	{
		"switch": "cscript",
		"description":
			"Specifies the path to your Custom Phase Script, which will be run as described in the Custom Phase Script section below.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "file",
		"argumentValue": "",
		"message": "Select a Custom Phase Script file.",
		"errorMessage": "A valid Custom Phase Script file is required."
	},

	{
		"switch": "csrc",
		"description":
			"A source directory string that can be used in your Custom Phase Script. One use for this is to have a directory tree where all your customizations are kept, and pass in the directory tree to sdm with --csrc.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "directory",
		"argumentValue": "",
		"message": "Select a Custom Phase Script directory.",
		"errorMessage": "A valid boot script directory is required.",
		"depends": "cscript"
	},
	{
		"switch": "datefmt",
		"description":
			"Use the specified date format instead of the default \"%Y-%m-%d %H:%M:%S\". See man date for format string details.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "%Y-%m-%d %H:%M:%S",
		"message": "Enter a date format string.",
		"errorMessage": "A valid date format string is required."

	},
	{
		"switch": "ddsw",
		"description": 
			"Provide switches for the dd command used with --burn. The default is \"bs=16M iflag=direct\". If --ddsw is specified, it replaces the default value.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "bs=16M iflag=direct",
		"message": "Enter dd switches.",
		"errorMessage": "A valid dd switch is required."
	},
	{
		"switch": "expand-root",
		"description":
			"Used with --burn. Expands the root partition on the SSD/SD Card after burning, and disables the default (quick) first boot that does this, since sdm has already expanded the partition.",
		"editable": false,
		"hasArgument": false
	},
	{
		"switch": "extend",
		"description": "Used in conjunction with the --xmb switch to extend an image. If used without --customize the IMG is extended but no other action is taken. If used with --customize the IMG is extended before the IMG is customized.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "groups",
		"description": "Specify the groups to be added to new users created with the user plugin. The default list is: dialout,cdrom,floppy,audio,video,plugdev,users,adm,sudo,users,input,netdev,spi,i2c,gpio.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "dialout,cdrom,floppy,audio,video,plugdev,users,adm,sudo,users,input,netdev,spi,i2c,gpio",
		"message": "Enter a list of user groups.",
		"errorMessage": "A valid list of user groups is required."
	},
	{
		"switch": "host/hostname",
		"description": "Specifies the name of the host to set onto the SD Card when burning it.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "raspberrypi",
		"message": "Enter a hostname.",
		"errorMessage": "A valid hostname is required."
	},
	{
		"switch": "loadlocal wifi",
		"description" :"Starts a WiFi Captive Portal to obtain and test the WiFi Credentials during the First Boot. See Captive Portal for details. The flashled and internet options are not supported with --loadlocal wifi.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{	"switch": "logwidth",
		"description": "Set the maximum log line width before lines are split. Default is 96 characters.",
		"selected": false,
		"editable":true,
		"hasArgument": true,
		"argumentType": "integer",
		"argumentValue": 96,
		"message":"Enter a width for the logfile.",
		"errorMessage":"A valid width for the log file is required."
	},
	{
		"switch": "norestart/noreboot",
		"description": "Do not restart the system after the First Boot. This is useful if you set --restart when you build the image, but want to disable the automatic restart for a particular SD Card when you burn it.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "nowait-timesync",
		"description": "Don't wait for the system time to sync in sdm FirstBoot.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "nspawnsw",
		"description": "Provide additional switches for the systemd-nspawn command. See man systemd-nspawn.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "",
		"message": "Enter one or more arguments for nspawn.",
		"errorMessage": "A valid argument for nspawn is required."
	},
	{
		"switch": "plugin",
		"description": "Include the named plugin with its arguments. sdm interprets a plugin name that starts with \"@\" as a file containing a list of plugins to include See Plugins for complete plugin details.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "",
		"message": "Enter a plugin name and arguments.",
		"errorMessage": "A valid plugin is required."
	},
	{
		"switch": "plugin-debug",
		"description": "Enable additional debug printout in plugins (useful for plugin development.).",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "poptions",
		"description": "Controls which functions will be performed by sdm-phase1. Possible values include: noautoremove — do not do an apt autoremove. noupdate — do not do an apt update. noupgrade — do not do an apt upgrade.  Enter multiple values as a single string separated by commas. For example --poptions noupdate,noupgrade",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "text",
		"argumentValue": "",
		"message": "Enter a single popoption or a comma seperated list.",
		"errorMessage": "A valid popoption is required."
	},
	{
		"switch": "reboot",
		"description": "Restart the system at the end of the First Boot after waiting an additional n seconds. The -reboot switch can be used on the command when customizing the IMG (will apply to all SD Cards) or on the --burn command (will apply only to SD cards burned with --restart set. The system will not restart until the boot process has fully completed. Waiting an additional time may be useful if your system has services that take longer to start up on the first boot. sdm waits until n seconds (n=20 for `--restart) after the graphical or multi-user target is reached.",
		"selected": false,
		"editable": true,
		"hasArgument": true,
		"argumentType": "integer",
		"argumentValue": "",
		"message": "Enter a number of seconds to wait.",
		"errorMessage": "A valid number of seconds is required."
	},
	{
		"switch": "redact",
		"description": "You can use the --redact switch with --customize or --burn. sdm will replace all occurrences of the matching strings in /etc/sdm/history with the string REDACTED. The redaction is a simple string replacement. Note that if --redact is used, the argument list will not be printed in the log or on the console when ANY plugins are run. However, if the user plugin argument redact is used without --redact, argument lists with passwords WILL be printed on the console.  If no printed passwords (in the log or on the console) is important to you, use --redact. ",
		"selected": true,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "redo-customize",
		"description": "Directs sdm to not prompt for confirmation to redo the customization on a target found to already be customized.",
		"selected": false,
		"editable": false,
		"hasArgument": false
	},
	{
		"switch": "regen-ssh-host-keys",
		"description": "The sdm FirstBoot process will regenerate the SSH host keys on the first system boot once the system time has been synchronized. The system will move ahead and regenerate the keys if the time has not been synchronized within 60 seconds.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
	{
		"switch": "restart",
		"description": "Restart the system at the end of the First Boot. The --restart switch and --reboot are synonomous except that you cannot specify an additional restart wait with the --restart switch.",
		"selected": false,
		"editable": true,
		"hasArgument": false
	},
]
--runonly plugins — Only run plugins. If no device or directory specified, sdm defaults to directory '/' on the running system.

--showapt — Show the output from apt (Package Manager) on the terminal in Phase 1. By default, the output is not displayed on the terminal. All apt output is captured in /etc/sdm/apt.log in the IMG.

--sdmdir /path/to — sdm normally is in /usr/local/sdm. If you want it to be put somewhere else when you customize an image, use this switch to specify the location. To install sdm itself into a different directory, specify it as the parameter to EZsdmInstall when you first install sdm

--update-plugins — Typically for sdm development use only. When plugins are used during an sdm burn, they are run from the copy in the source IMG. This switch causes sdm to look for newer updates on the host system, and update the burn target before running the plugins.

--vncbase base — Set the base port for VNC virtual desktops; RealVNC Console service is not changed.

--wifi-country countryname — Specify the name of the country to use for the WiFi Country setting. See /usr/share/zoneinfo/iso3166.tab for the complete WiFi Country code list. Also see the --l10n command switch which will extract the current WiFi Country setting from /etc/wpa_supplicant/wpa_supplicant.conf or /etc/wpa_supplicant/wpa_supplicant-wlan0.conf on the system on which sdm is running.

--xmb n — Specify the number of MB to extend the image. The default is 2048 (MB), which is 2GB. You may need to increase this depending on the number of packages you choose to install in Phase 1. If the image isn't large enough, package installations will fail. If the image is too large, it will consume more disk space, and burning the image to an SD Card will take longer.
